cf_billing/InformationRegisters/энргГруппыПотребителейАбонентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргГруппыПотребителейАбонентов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГруппаПотребителей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргГруппыПотребителейАбонентов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет группы потребителей абонентов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ГруппыПотребителейАбонентов(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "ГруппыПотребителейАбонентов") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема 						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
		
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаГруппыПотребителейАбонентов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 		= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	ПараметрПериод 					= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 		= Новый ВыражениеСхемыЗапроса(СтрШаблон("&%1",ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "Организация, Район, КлючПомещения, Услуга";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
	ВспомогательныеПоля 			= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаГруппыПотребителейАбонентов()
	
	Текст =
	"ВЫБРАТЬ
	|	ГруппыПотребителейАбонентов.Организация КАК Организация,
	|	ГруппыПотребителейАбонентов.Район КАК Район,
	|	ГруппыПотребителейАбонентов.КлючПомещения КАК КлючПомещения,
	|	ГруппыПотребителейАбонентов.Услуга КАК Услуга,
	|	ГруппыПотребителейАбонентов.ГруппаПотребителей КАК ГруппаПотребителей
	|ИЗ
	|	РегистрСведений.энргГруппыПотребителейАбонентов.СрезПоследних КАК ГруппыПотребителейАбонентов";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
